tests/jmeter/results/report/statistics.json
{
  "2. 查看商品详情 GET /product/6E92ZMYYFZ" : {
    "transaction" : "2. 查看商品详情 GET /product/6E92ZMYYFZ",
    "sampleCount" : 16,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 675.3125,
    "medianResTime" : 746.5,
    "minResTime" : 208.0,
    "maxResTime" : 1126.0,
    "pct1ResTime" : 967.8000000000002,
    "pct2ResTime" : 1126.0,
    "pct3ResTime" : 1126.0,
    "throughput" : 0.6202752471409189,
    "receivedKBytesPerSec" : 4.900492464624927,
    "sentKBytesPerSec" : 0.1550688117852297
  },
  "5. 清空购物车 POST /cart/empty-1" : {
    "transaction" : "5. 清空购物车 POST /cart/empty-1",
    "sampleCount" : 275,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1254.2909090909097,
    "medianResTime" : 1298.0,
    "minResTime" : 69.0,
    "maxResTime" : 2299.0,
    "pct1ResTime" : 1800.0,
    "pct2ResTime" : 1902.2,
    "pct3ResTime" : 2202.0,
    "throughput" : 8.243899514359374,
    "receivedKBytesPerSec" : 85.94250606113977,
    "sentKBytesPerSec" : 1.474738771434139
  },
  "商品详情 GET /product/OLJCESPC7Z" : {
    "transaction" : "商品详情 GET /product/OLJCESPC7Z",
    "sampleCount" : 15,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 797.9333333333334,
    "medianResTime" : 813.0,
    "minResTime" : 97.0,
    "maxResTime" : 1296.0,
    "pct1ResTime" : 1120.2,
    "pct2ResTime" : 1296.0,
    "pct3ResTime" : 1296.0,
    "throughput" : 0.9208103130755064,
    "receivedKBytesPerSec" : 7.386265538674033,
    "sentKBytesPerSec" : 0.17445039134438306
  },
  "首页 GET /" : {
    "transaction" : "首页 GET /",
    "sampleCount" : 500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1611.4900000000011,
    "medianResTime" : 1602.5,
    "minResTime" : 115.0,
    "maxResTime" : 2612.0,
    "pct1ResTime" : 2099.0,
    "pct2ResTime" : 2309.95,
    "pct3ResTime" : 2495.99,
    "throughput" : 15.56178026766262,
    "receivedKBytesPerSec" : 163.3986928104575,
    "sentKBytesPerSec" : 2.674680983504513
  },
  "5. 清空购物车 POST /cart/empty-0" : {
    "transaction" : "5. 清空购物车 POST /cart/empty-0",
    "sampleCount" : 275,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 158.04727272727288,
    "medianResTime" : 101.0,
    "minResTime" : 3.0,
    "maxResTime" : 1013.0,
    "pct1ResTime" : 301.0,
    "pct2ResTime" : 495.4,
    "pct3ResTime" : 786.5200000000027,
    "throughput" : 8.26595328984941,
    "receivedKBytesPerSec" : 0.7345720208752894,
    "sentKBytesPerSec" : 2.0518115588085006
  },
  "2. 查看商品详情 GET /product/9SIQT8TOJO" : {
    "transaction" : "2. 查看商品详情 GET /product/9SIQT8TOJO",
    "sampleCount" : 23,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 671.5217391304348,
    "medianResTime" : 598.0,
    "minResTime" : 295.0,
    "maxResTime" : 1201.0,
    "pct1ResTime" : 1056.6000000000001,
    "pct2ResTime" : 1179.3999999999996,
    "pct3ResTime" : 1201.0,
    "throughput" : 0.7827122681640293,
    "receivedKBytesPerSec" : 6.225905808660881,
    "sentKBytesPerSec" : 0.19567806704100732
  },
  "商品详情 GET /product/product_id" : {
    "transaction" : "商品详情 GET /product/product_id",
    "sampleCount" : 13,
    "errorCount" : 13,
    "errorPct" : 100.0,
    "meanResTime" : 280.61538461538464,
    "medianResTime" : 209.0,
    "minResTime" : 13.0,
    "maxResTime" : 906.0,
    "pct1ResTime" : 782.8,
    "pct2ResTime" : 906.0,
    "pct3ResTime" : 906.0,
    "throughput" : 0.9625351695542721,
    "receivedKBytesPerSec" : 4.940512549977788,
    "sentKBytesPerSec" : 0.18235529579446172
  },
  "商品详情 GET /product/LS4PSXUNUM" : {
    "transaction" : "商品详情 GET /product/LS4PSXUNUM",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 918.1,
    "medianResTime" : 848.5,
    "minResTime" : 593.0,
    "maxResTime" : 1602.0,
    "pct1ResTime" : 1561.7000000000003,
    "pct2ResTime" : 1602.0,
    "pct3ResTime" : 1602.0,
    "throughput" : 1.0418837257762035,
    "receivedKBytesPerSec" : 8.325098653365284,
    "sentKBytesPerSec" : 0.19738812773494477
  },
  "商品详情 GET /product/9SIQT8TOJO" : {
    "transaction" : "商品详情 GET /product/9SIQT8TOJO",
    "sampleCount" : 11,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 755.0,
    "medianResTime" : 801.0,
    "minResTime" : 207.0,
    "maxResTime" : 1003.0,
    "pct1ResTime" : 1003.0,
    "pct2ResTime" : 1003.0,
    "pct3ResTime" : 1003.0,
    "throughput" : 0.7381064215258673,
    "receivedKBytesPerSec" : 5.91133863567738,
    "sentKBytesPerSec" : 0.13983656814064283
  },
  "5. 清空购物车 POST /cart/empty" : {
    "transaction" : "5. 清空购物车 POST /cart/empty",
    "sampleCount" : 275,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1412.534545454545,
    "medianResTime" : 1400.0,
    "minResTime" : 76.0,
    "maxResTime" : 2500.0,
    "pct1ResTime" : 2096.4,
    "pct2ResTime" : 2203.0,
    "pct3ResTime" : 2496.48,
    "throughput" : 8.24216993855837,
    "receivedKBytesPerSec" : 86.6569337254608,
    "sentKBytesPerSec" : 3.5203373201708374
  },
  "1. 浏览首页 GET /" : {
    "transaction" : "1. 浏览首页 GET /",
    "sampleCount" : 305,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1460.1836065573773,
    "medianResTime" : 1417.0,
    "minResTime" : 145.0,
    "maxResTime" : 2577.0,
    "pct1ResTime" : 2015.6000000000001,
    "pct2ResTime" : 2206.5,
    "pct3ResTime" : 2508.7,
    "throughput" : 9.20699127599843,
    "receivedKBytesPerSec" : 96.67340839798351,
    "sentKBytesPerSec" : 1.58245162556223
  },
  "2. 添加商品 POST /cart" : {
    "transaction" : "2. 添加商品 POST /cart",
    "sampleCount" : 105,
    "errorCount" : 9,
    "errorPct" : 8.571428,
    "meanResTime" : 275.5047619047618,
    "medianResTime" : 201.0,
    "minResTime" : 3.0,
    "maxResTime" : 1196.0,
    "pct1ResTime" : 502.0,
    "pct2ResTime" : 801.8,
    "pct3ResTime" : 1184.1799999999996,
    "throughput" : 3.3285782215882076,
    "receivedKBytesPerSec" : 1.7244709938183547,
    "sentKBytesPerSec" : 0.9719188361864003
  },
  "2. 查看商品详情 GET /product/2ZYFJ3GM2N" : {
    "transaction" : "2. 查看商品详情 GET /product/2ZYFJ3GM2N",
    "sampleCount" : 22,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 589.6363636363636,
    "medianResTime" : 596.0,
    "minResTime" : 194.0,
    "maxResTime" : 1079.0,
    "pct1ResTime" : 869.9,
    "pct2ResTime" : 1051.9999999999995,
    "pct3ResTime" : 1079.0,
    "throughput" : 0.8240317626788524,
    "receivedKBytesPerSec" : 6.542068928384149,
    "sentKBytesPerSec" : 0.2060079406697131
  },
  "商品详情 GET /product/66VCHSJNUP" : {
    "transaction" : "商品详情 GET /product/66VCHSJNUP",
    "sampleCount" : 14,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 820.7857142857144,
    "medianResTime" : 849.5,
    "minResTime" : 210.0,
    "maxResTime" : 1295.0,
    "pct1ResTime" : 1152.5,
    "pct2ResTime" : 1295.0,
    "pct3ResTime" : 1295.0,
    "throughput" : 0.8339786739739083,
    "receivedKBytesPerSec" : 6.646698337999643,
    "sentKBytesPerSec" : 0.15799986596771312
  },
  "商品详情 GET /product/2ZYFJ3GM2N" : {
    "transaction" : "商品详情 GET /product/2ZYFJ3GM2N",
    "sampleCount" : 18,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 818.5,
    "medianResTime" : 897.5,
    "minResTime" : 120.0,
    "maxResTime" : 1602.0,
    "pct1ResTime" : 1243.8000000000006,
    "pct2ResTime" : 1602.0,
    "pct3ResTime" : 1602.0,
    "throughput" : 1.0150566739976314,
    "receivedKBytesPerSec" : 8.12381268327412,
    "sentKBytesPerSec" : 0.19230565894095752
  },
  "2. 查看商品详情 GET /product/66VCHSJNUP" : {
    "transaction" : "2. 查看商品详情 GET /product/66VCHSJNUP",
    "sampleCount" : 20,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 690.1499999999999,
    "medianResTime" : 699.5,
    "minResTime" : 104.0,
    "maxResTime" : 1198.0,
    "pct1ResTime" : 1166.6000000000006,
    "pct2ResTime" : 1197.9,
    "pct3ResTime" : 1198.0,
    "throughput" : 0.6097375080028048,
    "receivedKBytesPerSec" : 4.8215112534678815,
    "sentKBytesPerSec" : 0.1524343770007012
  },
  "2. 查看商品详情 GET /product/product_id" : {
    "transaction" : "2. 查看商品详情 GET /product/product_id",
    "sampleCount" : 25,
    "errorCount" : 25,
    "errorPct" : 100.0,
    "meanResTime" : 165.96,
    "medianResTime" : 100.0,
    "minResTime" : 3.0,
    "maxResTime" : 887.0,
    "pct1ResTime" : 435.4000000000002,
    "pct2ResTime" : 771.4999999999998,
    "pct3ResTime" : 887.0,
    "throughput" : 0.7649236606186702,
    "receivedKBytesPerSec" : 3.864956074258789,
    "sentKBytesPerSec" : 0.19123091515466756
  },
  "4. 切换货币 POST /setCurrency" : {
    "transaction" : "4. 切换货币 POST /setCurrency",
    "sampleCount" : 75,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1476.4666666666665,
    "medianResTime" : 1400.0,
    "minResTime" : 287.0,
    "maxResTime" : 2599.0,
    "pct1ResTime" : 2099.8,
    "pct2ResTime" : 2322.8,
    "pct3ResTime" : 2599.0,
    "throughput" : 2.3160300157490044,
    "receivedKBytesPerSec" : 24.667770319303337,
    "sentKBytesPerSec" : 1.1037330543803847
  },
  "2. 查看商品详情 GET /product/OLJCESPC7Z" : {
    "transaction" : "2. 查看商品详情 GET /product/OLJCESPC7Z",
    "sampleCount" : 17,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 663.7647058823529,
    "medianResTime" : 700.0,
    "minResTime" : 101.0,
    "maxResTime" : 998.0,
    "pct1ResTime" : 923.5999999999999,
    "pct2ResTime" : 998.0,
    "pct3ResTime" : 998.0,
    "throughput" : 0.6249540474965076,
    "receivedKBytesPerSec" : 4.968183635394456,
    "sentKBytesPerSec" : 0.1562385118741269
  },
  "商品详情 GET /product/6E92ZMYYFZ" : {
    "transaction" : "商品详情 GET /product/6E92ZMYYFZ",
    "sampleCount" : 20,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 755.7999999999998,
    "medianResTime" : 852.5,
    "minResTime" : 50.0,
    "maxResTime" : 1312.0,
    "pct1ResTime" : 1089.4,
    "pct2ResTime" : 1301.35,
    "pct3ResTime" : 1312.0,
    "throughput" : 1.1806375442739079,
    "receivedKBytesPerSec" : 9.398751106847698,
    "sentKBytesPerSec" : 0.2236754722550177
  },
  "4. 查看购物车 GET /cart" : {
    "transaction" : "4. 查看购物车 GET /cart",
    "sampleCount" : 200,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 647.5150000000003,
    "medianResTime" : 601.5,
    "minResTime" : 10.0,
    "maxResTime" : 1596.0,
    "pct1ResTime" : 1071.5000000000005,
    "pct2ResTime" : 1103.9,
    "pct3ResTime" : 1298.99,
    "throughput" : 6.01015716560988,
    "receivedKBytesPerSec" : 90.57667810161674,
    "sentKBytesPerSec" : 1.4203691739038975
  },
  "2. 查看商品详情 GET /product/1YMWWN1N4O" : {
    "transaction" : "2. 查看商品详情 GET /product/1YMWWN1N4O",
    "sampleCount" : 18,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 605.0555555555555,
    "medianResTime" : 552.0,
    "minResTime" : 195.0,
    "maxResTime" : 1199.0,
    "pct1ResTime" : 1107.2,
    "pct2ResTime" : 1199.0,
    "pct3ResTime" : 1199.0,
    "throughput" : 0.845229151014275,
    "receivedKBytesPerSec" : 6.715976591848235,
    "sentKBytesPerSec" : 0.21130728775356875
  },
  "2. 查看商品详情 GET /product/LS4PSXUNUM" : {
    "transaction" : "2. 查看商品详情 GET /product/LS4PSXUNUM",
    "sampleCount" : 15,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 559.8666666666667,
    "medianResTime" : 505.0,
    "minResTime" : 298.0,
    "maxResTime" : 900.0,
    "pct1ResTime" : 838.8000000000001,
    "pct2ResTime" : 900.0,
    "pct3ResTime" : 900.0,
    "throughput" : 0.5103082261686058,
    "receivedKBytesPerSec" : 4.037548054024631,
    "sentKBytesPerSec" : 0.12757705654215146
  },
  "4. 切换货币 POST /setCurrency-0" : {
    "transaction" : "4. 切换货币 POST /setCurrency-0",
    "sampleCount" : 75,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 104.17333333333329,
    "medianResTime" : 98.0,
    "minResTime" : 2.0,
    "maxResTime" : 403.0,
    "pct1ResTime" : 200.4,
    "pct2ResTime" : 222.60000000000025,
    "pct3ResTime" : 403.0,
    "throughput" : 2.352350782548694,
    "receivedKBytesPerSec" : 0.3170160234294138,
    "sentKBytesPerSec" : 0.6684903102750682
  },
  "4. 切换货币 POST /setCurrency-1" : {
    "transaction" : "4. 切换货币 POST /setCurrency-1",
    "sampleCount" : 75,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1371.9466666666663,
    "medianResTime" : 1396.0,
    "minResTime" : 200.0,
    "maxResTime" : 2395.0,
    "pct1ResTime" : 1942.8000000000006,
    "pct2ResTime" : 2199.6,
    "pct3ResTime" : 2395.0,
    "throughput" : 2.322269011642309,
    "receivedKBytesPerSec" : 24.421259114905872,
    "sentKBytesPerSec" : 0.44676464384134257
  },
  "3. 查看购物车 GET /cart" : {
    "transaction" : "3. 查看购物车 GET /cart",
    "sampleCount" : 75,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 700.8,
    "medianResTime" : 794.0,
    "minResTime" : 13.0,
    "maxResTime" : 1302.0,
    "pct1ResTime" : 1000.4,
    "pct2ResTime" : 1098.0,
    "pct3ResTime" : 1302.0,
    "throughput" : 2.3581197924854584,
    "receivedKBytesPerSec" : 35.94747902255935,
    "sentKBytesPerSec" : 0.5572900290834775
  },
  "商品详情 GET /product/L9ECAV7KIM" : {
    "transaction" : "商品详情 GET /product/L9ECAV7KIM",
    "sampleCount" : 15,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 724.6000000000001,
    "medianResTime" : 700.0,
    "minResTime" : 289.0,
    "maxResTime" : 1098.0,
    "pct1ResTime" : 1095.6,
    "pct2ResTime" : 1098.0,
    "pct3ResTime" : 1098.0,
    "throughput" : 0.9436336185203825,
    "receivedKBytesPerSec" : 7.537826438254907,
    "sentKBytesPerSec" : 0.17877433788374433
  },
  "商品详情 GET /product/1YMWWN1N4O" : {
    "transaction" : "商品详情 GET /product/1YMWWN1N4O",
    "sampleCount" : 17,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 749.2941176470586,
    "medianResTime" : 702.0,
    "minResTime" : 203.0,
    "maxResTime" : 1410.0,
    "pct1ResTime" : 1320.3999999999999,
    "pct2ResTime" : 1410.0,
    "pct3ResTime" : 1410.0,
    "throughput" : 1.428451390639442,
    "receivedKBytesPerSec" : 11.460516054323167,
    "sentKBytesPerSec" : 0.27062457986723804
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 2815,
    "errorCount" : 72,
    "errorPct" : 2.5577264,
    "meanResTime" : 974.4714031971606,
    "medianResTime" : 999.0,
    "minResTime" : 2.0,
    "maxResTime" : 2612.0,
    "pct1ResTime" : 1897.0,
    "pct2ResTime" : 2095.2,
    "pct3ResTime" : 2398.0,
    "throughput" : 83.94966002624359,
    "receivedKBytesPerSec" : 687.8994551845999,
    "sentKBytesPerSec" : 20.64099335150006
  },
  "3. 加入购物车 POST /cart" : {
    "transaction" : "3. 加入购物车 POST /cart",
    "sampleCount" : 200,
    "errorCount" : 25,
    "errorPct" : 12.5,
    "meanResTime" : 187.16500000000008,
    "medianResTime" : 197.0,
    "minResTime" : 2.0,
    "maxResTime" : 799.0,
    "pct1ResTime" : 300.0,
    "pct2ResTime" : 400.9,
    "pct3ResTime" : 799.0,
    "throughput" : 6.027727546714889,
    "receivedKBytesPerSec" : 4.297846264692586,
    "sentKBytesPerSec" : 1.7600493520192888
  },
  "2. 查看商品详情 GET /product/L9ECAV7KIM" : {
    "transaction" : "2. 查看商品详情 GET /product/L9ECAV7KIM",
    "sampleCount" : 21,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 609.9047619047619,
    "medianResTime" : 601.0,
    "minResTime" : 195.0,
    "maxResTime" : 1127.0,
    "pct1ResTime" : 1038.6000000000001,
    "pct2ResTime" : 1124.2,
    "pct3ResTime" : 1127.0,
    "throughput" : 0.8643753858818687,
    "receivedKBytesPerSec" : 6.836098284111957,
    "sentKBytesPerSec" : 0.21609384647046717
  },
  "3. 提交订单 POST /cart/checkout" : {
    "transaction" : "3. 提交订单 POST /cart/checkout",
    "sampleCount" : 30,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 647.4666666666668,
    "medianResTime" : 697.5,
    "minResTime" : 102.0,
    "maxResTime" : 1497.0,
    "pct1ResTime" : 903.5,
    "pct2ResTime" : 1272.0499999999997,
    "pct3ResTime" : 1497.0,
    "throughput" : 1.4778325123152711,
    "receivedKBytesPerSec" : 10.050415640394089,
    "sentKBytesPerSec" : 0.7345866687192117
  },
  "2. 查看商品详情 GET /product/0PUK6V6EV0" : {
    "transaction" : "2. 查看商品详情 GET /product/0PUK6V6EV0",
    "sampleCount" : 23,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 604.4347826086955,
    "medianResTime" : 599.0,
    "minResTime" : 200.0,
    "maxResTime" : 1102.0,
    "pct1ResTime" : 958.2000000000002,
    "pct2ResTime" : 1080.9999999999998,
    "pct3ResTime" : 1102.0,
    "throughput" : 0.9351494206139459,
    "receivedKBytesPerSec" : 7.401426547570645,
    "sentKBytesPerSec" : 0.2337873551534865
  },
  "商品详情 GET /product/0PUK6V6EV0" : {
    "transaction" : "商品详情 GET /product/0PUK6V6EV0",
    "sampleCount" : 17,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 788.0588235294118,
    "medianResTime" : 885.0,
    "minResTime" : 67.0,
    "maxResTime" : 1599.0,
    "pct1ResTime" : 1281.3999999999996,
    "pct2ResTime" : 1599.0,
    "pct3ResTime" : 1599.0,
    "throughput" : 1.2774271115118725,
    "receivedKBytesPerSec" : 10.20973051923655,
    "sentKBytesPerSec" : 0.24201255823564774
  }
}